{"_id":{"$oid":"5da02a5ee1cb2948a02e6cb3"},"ideaName":"Verify the new built slsc firmware image is workable before downloading it to the real hardware.","description":"When SLSC team developed a new firmware image, there is a big risk that it will make the hardware unfunctional at all. It will cost us a long time to use JTAG to recover it back. It will be very helpful that if we have some tool to help us do some basic verification before downloading it.","proposer":"Xiang Shen","department":"PPIO","status":"new","__v":0}
{"_id":{"$oid":"5da0396ce1cb2948a02e6cb8"},"ideaName":"Develop a tool analysis a VI's pattern, connector information and other properties.","description":"When a lot of LV APIs are created, we need to check their connector and terminals. It will be nice to automately generate a report about these information.","proposer":"Zhen Yang","department":"PPIO","status":"new","__v":0}
{"_id":{"$oid":"5da03989e1cb2948a02e6cb9"},"ideaName":"Statistic azdo work item efforts to help PM anylysis project status","description":"I always spend a lot of time on tracing the employee's working time on mutlitple projects. It will be nice if we have some tools to export the time automatically from azdo.","proposer":"Wendy Yang","department":"PPIO","status":"new","__v":0}
{"_id":{"$oid":"5da0399de1cb2948a02e6cba"},"ideaName":"Deploy one MI component to customized GitLab Auto DevOps","description":"GitLab Auto DevOps is an open source DevOps solution. It contains a set of tools include CI/CD tools. Build a customized GitLab Auto DevOps on local server and deploy one simple MI component to it to see if it can improve the efficiency.","proposer":"Zeyi Shen","department":"PPIO","status":"new","__v":0}
{"_id":{"$oid":"5da03a2ce1cb2948a02e6cbd"},"ideaName":"Migrate OPC UA Toolkit to Linux Desktop","description":"One of the early known outcomes of the strategy sessions is that Linux Desktop and RT are going to become a major priority for the next two years. For example, we expect to expand our Linux Desktop support by 2021 to include Ubuntu for all drivers and to add more driver, toolkit and application support. There are still details to be worked out but an important first step is to have a try and collect enough experience on how to estimate the migrating effort","proposer":"Yin Wang, Hua Zhang","department":"PPIO","status":"new","__v":0}
{"_id":{"$oid":"5da03a46e1cb2948a02e6cbe"},"ideaName":"Show how CPU work via LabVIEW","description":"Implement a CPU simulator via LabVIEW. LabVIEW has highlight feature, so we can show the data flow of CPU execution.","proposer":"Zhekai Wu","department":"PPIO","status":"new","__v":0}
{"_id":{"$oid":"5da03fc7e1cb2948a02e6cbf"},"ideaName":"One Key to Submit Performance Goals","description":"We currently use spreadsheets to manage our performance goals.  I can imagine very soon everyone would need to import the data to MyVIEW manually.  I'm looking for a tool to automate this work. ","proposer":"Haibing Jiang","department":"PPIO","status":"new","__v":0}
{"_id":{"$oid":"5da04469e1cb2948a02e6cc1"},"ideaName":"Create an EtherCAT PSE robot on preliminary triaging","description":"The robot is expected to handle the following time-consuming work for EtherCAT escalations:\n1. Eat the ESI files and spit out if there is any known incompatibility\n2. Eat the ESI files and spit out workaround ESIs if possible\n3. Eat the Wireshark caputre file and spit out what errors happened","proposer":"Yin Wang, Zheng chen, Lucas Zhang","department":"PPIO","status":"new","__v":0}
{"_id":{"$oid":"5da130a2e1cb2948a02e6cc5"},"ideaName":"Find out the dulplicated depencies that already defined through the other distribution workingset.","description":"When EtherCAT team upgrades dependencies in the distribution file, we always manually aligned versions with rioworkingset. If we want to leverage rioworkingset dependencies, it will cost us a long time to figure out which components have already defined in rioworkingset. Duplicated dependencies will entries override the rioworkingset versions. A tool to detect the conflict will be helpful.","proposer":"Xiang Shen","department":"PPIO","status":"new","__v":0}
{"_id":{"$oid":"5da13939b621c9511c622d81"},"ideaName":"Ideas colletion system for innovation(web site)","description":"This will be an end-to-end innovation-idea/continous-improment-idea management website.\nThis website will be focused on the execution of the whole life circle of ideas that are submitted.\nIt provides a procedure that can force/help the ideas down to ground, being traced continuously, easy to be found and share.","proposer":"Minjie Qiu, Yuxiang Wang, Hua Zhang","department":"PPIO","status":"new","__v":0}
